Repository: ryancog/ProffieConfig
Catalog: resources/i18n/*/proffieconfig.po
Languages: es

source: On/Off - Click to turn the saber on or off. Turn On muted - Double-click Next preset - Hold button and hit the blade while saber is off. Clash - Hit the blade while saber is on. Lockup - Hold button, then trigger a clash. Release button to end. Drag - Hold button, then trigger a clash while pointing down. Release button to end. Melt - Hold button and stab something. Force - Long-click button. Start Soundtrack - Long-click the button while blade is off. Enter/Exit Color Change - Hold button and Twist.
es: Encendido/Apagado - Cliquear para encender o apagar el sable. Encender Silenciado - Doble-clic. Preset Siguiente - Mantener el botón y golpear la hoja con el sable apagado. Choque - Golpear la hoja con el sable encendido. Encuentro - Mantener presionado el botón, luego generar un choque. Liberar el botón para finalizar. Arrastre - Mantener presionado el botón, luego generar un choque con el sable apuntando para abajo. Liberar el botón para finalizar. Derretir - Mantener presionado el botón, y clavar el sable en algo. Fuerza - Clic largo del botón. Iniciar Pista de Sonido - Clic largo del botón, con el sable apagado. Entrar/Salir del Cambio de Color - Mantener presionado el botón y rotar.

source: On/Off - Click POW Turn On muted - Double-click POW button Next preset - Hold POW button and hit the blade while saber is off. Previous Preset - Hold AUX button and click the POW button while saber is off. Clash - Hit the blade while saber is on. Lockup - Hold either POW or AUX, then trigger a clash. Release button to end. Drag - Hold either POW or AUX, then trigger a clash while pointing down. Release button to end. Melt - Hold either POW or AUX and stab something. Force Lightning Block - Click AUX while holding POW. Force - Long-click POW button. Start Soundtrack - Long-click the POW button while blade is off. Blaster block - Short-click AUX button. Enter/Exit Color Change - Hold Aux and click POW while on.
es: Encendido/Apagado - Cliquear POW Encender Silenciado - Doble-clic de botón POW Preset Siguiente - Mantener el botón POW y golpear la hoja con el sable apagado. Preset Anterior - Mantener el botón AUX y cliquear el botón POW con el sable apagado. Choque - Golpear la hoja con el sable encendido. Encuentro - Mantener POW o AUX, luego generar un choque. Liberar el botón para finalizar. Arrastre - Mantener POW o AUX, luego generar un choque con el sable apuntando para abajo. Liberar el botón para finalizar. Derretir - Mantener POW o AUX y clavar el sable en algo. Bloqueo de Rayos de la Fuerza - Cliquear AUX con se mantiene POW. Fuerza - Clic largo del botón POW. Iniciar Pista de Sonido - Clic largo del botón POW con el sable apagado. Bloqueo de Arma Laser - Clic corto del botón AUX. Entrar/Salir del Cambio de Color - Mantener AUX y cliquear POW con el sable encendido.

source: Button Configuration Not Supported
es: Configuración de botones no admitida

source: Selected number of buttons not supported by prop file.
es: El número de botones elegido no es admitido por el archivo de prop.

source: Button controls while saber is %s:
es: Control por botones si el sable está %s:

source: The default ProffieOS prop file.
es: El archivo de prop de ProffieOS por defecto.

source: %s Prop Info
es: Información de Prop %s

source: ProffieConfig is Already Running
es: ProffieConfig ya se está ejecutando

source: Add New Config
es: Agregar una Configuración Nueva

source: Create New Config
es: Crear una Configuración Nueva

source: Import Existing Config
es: Importar la Configuración Existente

source: Configuration to Import
es: Configuración a Importar

source: Choose Configuration File to Import
es: Elija el archivo de configuración a importar

source: Configuration Name
es: Nombre de Configuración

source: Please enter a valid name
es: Por favor, ingrese un nombre válido

source: Configuration with same name already exists
es: Ya existe una configuración con el mismo nombre

source: Please choose a configuration file to import
es: Por favor, elija el archivo de configuración a importar

source: Prop Files
es: Archivos de Prop

source: View Existing Props
es: Ver Props Existentes

source: Add Prop
es: Agregar Prop

source: ProffieOS Prop File
es: Archivo de Prop de ProffieOS

source: Choose Prop File to Import
es: Elija un archivo de prop para importar

source: ProffieConfig Prop Config File
es: Archivo de configuración de prop de ProffieConfig

source: Choose Prop Config File
es: Elija un archivo de configuración de prop

source: Prop with same name already exists
es: Ya existe un prop con el mismo nombre

source: Please choose prop files to import
es: Por favor, elija archivos de prop a importar

source: No Custom Props
es: Sin Props Personalizados

source: There is at least one editor open with unsaved changes, are you sure you want to exit?
es: Hay, al menos, un editor abierto con cambios sin guardar. ¿Está seguro de que desea salir?

source: All unsaved changes will be lost!
es: ¡Todos los cambios que no se hayan guardado se perderán!

source: Open Editor(s)
es: Abrir Editor(es)

source: All-in-one Proffieboard Management Utility
es: Herramienta de operación Todo-en-Uno

source: All Editors must be closed to continue.
es: Todos los editores deben cerrarse para poder continuar.

source: Open Editors
es: Abrir editores

source: Are you sure you want to deleted the selected configuration?
es: ¿Está seguro de querer eliminar la configuración seleccionada?

source: Delete Config
es: Eliminar Configuración

source: Apply the current configuration to the selected Proffieboard.
es: Aplicar la configuración actual al Proffieboard seleccionado.

source: Select the Proffieboard to connect to. These IDs are assigned by the OS, and can vary.
es: Seleccione el Proffieboard al que desea conectarse. Estos identificadores son asignados por el SO, y pueden variar.

source: Generate an up-to-date list of connected boards.
es: Generar una lista actualizada de las placas conectadas.

source: Re-Run First-Time Setup...
es: Volver a ejecutar la configuración de primer uso...

source: Install Proffieboard Dependencies and View Tutorial
es: Instalar las dependencias de Proffieboard y ver el tutorial

source: Show Logs...
es: Mostrar registros...

source: Documentation... Ctrl+H
es: Documentación... Ctrl+H

source: Open the ProffieConfig docs in your web browser
es: Abrir los documentos de ProffieConfig en su explorador

source: Help/Bug Report...
es: Ayuda/Reporte de errores...

source: Open GitHub to submit issue
es: Abrir GitHub para reportar un problema

source: Created by Ryryog25
es: Creado por Ryryog25

source: Add
es: Agregar

source: Edit Selected Configuration
es: Editar la configuración seleccionada

source: Select Board...
es: Seleccionar placa...

source: BOOTLOADER RECOVERY
es: RECUPERACIÓN DE BOOTLOADER

source: Refresh Boards
es: Actualizar tablas

source: Apply Selected Configuration to Board
es: Aplicar configuración seleccionada a la placa

source: Open Serial Monitor
es: Abrir Monitor Serial

source: Select Config...
es: Seleccionar Configuración...

source: Error while reading configuration file!
es: ¡Error durante la lectura del archivo de configuración!

source: Config Read Error
es: Error de lectura de la configuración

source: ProffieConfig First-Time Setup
es: Configuración de primer uso de ProffieConfig

source: Skip Introduction
es: Saltar la introducción

source: Skip Dependency Installation
es: Saltar la instalación de dependencias

source: Next >
es: Siguiente >

source: Are you sure you want to cancel setup?
es: ¿Está seguro de querer cancelar la configuración?

source: Exit ProffieConfig
es: Salir de ProffieConfig

source: Are you sure you want to skip the Introduction?
es: ¿Está seguro de querer saltarse la introducción?

source: The introduction covers all the basics and usage of ProffieConfig.
es: La introducción cubre los aspectos básicos y el uso de ProffieConfig.

source: Dependency installation failed, please try again.
es: Fallo en la instalación de dependencias. Por favor, inténtelo de nuevo.

source: Installation Failure
es: Fallo en la instalación

source: Finish
es: Finalizar

source: Dependency Installation
es: Instalación de dependencias

source: In order to continue, ProffieConfig needs to do some setup.
es: Para poder continuar, ProffieConfig necesita hacer algunos ajustes.

source: This will involve the following:
es: Esto requerirá lo siguiente:

source: ProffieOS Download
es: Descargar ProffieOS

source: Proffieboard Arduino Core Installation
es: Instalación del núcleo Arduino para Proffieboard

source: Proffieboard Driver Installation
es: Instalación del controlador de Proffieboard

source: An internet connection is required, and installation may take several minutes.
es: Se necesita una conexión a Internet, y la instalación puede tomar varios minutos.

source: When the driver installation starts, you will be prompted, please follow the instructions in the new window.
es: Cuando se inicie la instalación del controlador, se lo consultará. Por favor, siga las instrucciones en la nueva ventana.

source: Press "Next" to begin installation.
es: Presione "Siguiente" para comenzar con la instalación.

source: The installation completed successfully. Press "Next" to continue...
es: La instalación se completó exitosamente. Presione "Siguiente" para continuar...

source: Introduction to ProffieConfig
es: Introducción a ProffieConfig

source: You cannot close this during First-Time Setup.
es: No puede cerrar esto durante la configuración de primer uso.

source: Close ProffieConfig
es: Cerrar ProffieConfig

source: Close ProffieConfig Editor
es: Cerrar el editor de ProffieConfig

source: Welcome to ProffieConfig %s!
es: ¡Bienvenido a ProffieConfig, %s!

source: ProffieConfig is an All-in-One utility for managing your Proffieboard. Links to documentation can be found in the application under Help->Documentation... This wizard will guide you through first-time setup and usage of ProffieConfig. Press "Next" when you're ready to continue, and we'll get started!
es: ProffieConfig es una herramienta de operación Todo-en-Uno para su Proffieboard. Los links de acceso a la documentación pueden encontrarse en la aplicación, yendo a Ayuda->Documentación... Este Wizard lo guiará a través del proceso de configuración de primer uso de ProffieConfig. Presione "Siguiente" cuando esté listo para continuar, ¡y comenzaremos!

source: Please make sure your board is connected and selected, then try again!
es: ¡Por favor, asegúrese de que su placa está conectada y seleccionada, y vuelva a intentarlo!

source: Board Selection Error
es: Error de selección de placa

source: There was an error while updating ProffieOS file: %s
es: Se produjo un error mientras se actualizaba el archivo ProffieOS: %s

source: Files Error
es: Error de archivos

source: There was an error while compiling: %s
es: Se produjo un error durante la compilación: %s

source: Compile Error
es: Error de compilación

source: There was an error while uploading: %s
es: Se produjo un error mientras se cargaban los datos: %s

source: Upload Error
es: Error en la carga de datos

source: Changes Successfully Applied to ProffieBoard!
es: ¡Cambios aplicados en el Proffieboard exitosamente!

source: Apply Changes to Board
es: Aplicar los cambios en la placa

source: Config Verified Successfully!
es: ¡La configuración se verificó exitosamente!

source: The configuration uses %d%% of board space. (%d/%d)
es: La configuración usa %d%% del espacio disponible en la placa. (%d/%d)

source: Verify Config
es: Verificar Configuración

source: Select board first.
es: Seleccione una placa, primero.

source: No Board Selected
es: No seleccionó una placa

source: Could not connect to Proffieboard.
es: No se puede conectar al Proffieboard.

source: Serial Connection Error
es: Error en la conexión serial

source: Prop Files...
es: Archivos de Prop…
