Repository: ryancog/ProffieConfig
Catalog: resources/i18n/*/proffieconfig.po
Languages: es

source: Prop config file is invalid.
es: El archivo de configuración de su Prop no es válido.

source: Error Adding Prop
es: Error al agregar el Prop

source: Prop config filename does not match provided prop filename
es: El nombre del archivo de configuración del Prop no coincide con el nombre del Prop provisto

source: Configuration not saved.
es: No se ha guardado la configuración.

source: Configuration Error
es: Error de configuración

source: Failed setting up injection "%s"
es: No se pudo inyectar la configuración "%s"

source: Could not open config file for output.
es: No se pudo abrir el archivo de configuración de salida.

source: Injection file "%s" has an invalid name and cannot be registered. You may add a substitute after import.
es: El archivo de inyección "%s" tiene un nombre inválido y no se pudo registrar. Puede agregar un reemplazo luego de la importación.

source: Unknown Injection Encountered
es: Se produjo una inyección de tipo desconocido

source: Injection file "%s" has not been registered. Would you like to add the injection file now?
es: No se ha registrado el archivo de inyección "%s". ¿Desea agregar un archivo de inyección ahora?

source: Injection file could not be added.
es: No se pudo agregar el archivo de inyección.

source: Blade Detect Pin cannot be empty.
es: El pin de detección de hoja no puede estar vacío.

source: Blade ID Pin cannot be empty.
es: El pin identificador de hoja no puede estar vacío.

source: Blade Array Name cannot be empty.
es: El nombre de la matriz de hojas no puede estar vacío.

source: Pullup Pin cannot be empty.
es: El pin pullup no puede estar vacío.

source: Blade ID Pin and Blade Detect Pin cannot be the same.
es: El pin identificador de hoja debe ser distinto al pin de detección de hoja.

source: All Blade Arrays must be the same length. Please add/remove blades to make them equal
es: Todas las matrices de hojas deben tener el mismo tamaño. Por favor, agregue o quite hojas para que estas sean iguales

source: Simple blade %d in array "%s" with %d active LEDs should have %d power pins selected. (Has %d)
es: La hoja simple %d en la matriz \"%s\" con %d LED activos deben tener %d pines de alimentación seleccionados. (Tiene %d)

source: Malformed bladestyle in preset %s in blade array %s: %s
es: Forma incorrecta de estilo de hoja en el preset %s de la matriz de hojas %s: %s

source: Blade Awareness
es: Reconocimiento de Hojas

source: Enable Blade Detect
es: Habilitar Detección de Hoja

source: Enable Blade ID
es: Habilitar Identificador de Hojas

source: Are you sure you want to disable Blade Detect?
es: ¿Está seguro de querer deshabilitar la Detección de Hoja?

source: blade array will be deleted!
es: ¡Se eliminará la matriz de hojas!

source: Disable Blade Detect
es: Deshabilitar Detección de Hoja

source: Are you sure you want to disable Blade ID? All custom blade arrays will be deleted!
es: ¿Está seguro de querer deshabilitar el identificador de Hojas? ¡Todas las matrices de hojas personalizadas se eliminarán!

source: Disable Blade ID
es: Habilitar Identificador de Hojas

source: Detect when a blade is inserted into the saber or not.
es: Detecta si hay una hoja insertada en la empuñadura del sable o no.

source: Detect when a specific blade is inserted based on a resistor placed in the blade to give it an identifier.
es: Detecta que una hoja específica fue insertada, de acuerdo al valor del resistor instalado en la hoja para darle una identificación.

source: The pin which will be bridged to BATT- when blade is inserted. Cannot be the same as ID Pin.
es: El pin que será conectado a BATT- cuando se inserte la hoja. No puede ser el mismo que el pin identificador.

source: The pin used to detect blade resistance values. Cannot be the same as Detect Pin.
es: El pin usado para detectar los valores de resistencia de la hoja. No puede ser el mismo que el pin de detección.

source: The mode to be used for Blade ID. See the POD page "Blade ID" for more info.
es: El modo que se utilizará para identificar la hoja. Para más información, lea la página de POD "Identificador de Hoja".

source: The value of the pullup resistor placed on the Blade ID line.
es: El valor del resistor pullup instalado en la línea identificadora de hoja.

source: The pin number or name of the pin which ID Pin is bridged to for pullup. This pin cannot be used for anything else.
es: El número de pin o nombre del pin al que está conectado el Pin de Identificación para el estado pullup. Este pin no puede ser usado para nada más.

source: Enable power during Blade ID. This is required for WS281X blades.
es: Habilitar el encendido durante la identificación de la hoja. Esto se necesita para las hojas WS281X.

source: Continuously monitor the Blade ID to detect changes.
es: Monitoreo continuo del Identificador de Hojas para detectar cambios.

source: Scan the Blade ID and update accordingly every input number of millis.
es: Leer el Identificador de Hojas y actualizar conforme al número de millis indicado.

source: Number of times to read the Blade ID to average out the result and compensate for inaccurate readings.
es: Número de veces que se leerá el Identificador de Hojas para promediar los resultados y compensar los errores de lectura.

source: Add a blade array which will be enabled when a blade with the specified ID is inserted.
es: Agregar un array de hoja que se habilitará cuando se inserte una hoja con un identificador específico.

source: Remove the selected blade array.
es: Eliminar el array de hoja seleccionado.

source: The name of the blade array. Each name must be unique, but it is for reference only (and thus specific names will not make a difference).
es: El nombre del array de hoja. Cada nombre debe ser único, pero solo es para referencia (por ende, nombres específicos no van a hacer una diferencia).

source: The ID of the blade associated with the currently-selected blade array. This value can be measured by typing "id" into the Serial Monitor.
es: El Identificador de la hoja asociada con el array de hoja seleccionado. Este valor puede ser medido escribiendo "id" en el Monitor Serial.

source: Blade Arrays
es: Arrays de Hojas

source: Blade Array Name
es: Nombre del Array de Hoja

source: ID Value
es: Valor del Identificador

source: Blade ID Setup
es: Ajuste del Identificador de Hojas

source: Snapshot
es: Instantánea

source: External Pullup
es: Pullup Externo

source: Bridged Pullup
es: Pullup Puenteado

source: Blade ID Mode
es: Modo del Identificador de Hojas

source: Blade ID Pin
es: Pin del Identificador de Hojas

source: Pullup Resistance
es: Resistencia Pullup

source: Pullup Pin
es: Pin Pullup

source: Power for Blade ID
es: Alimentación para el Identificador de Hojas

source: Enable Power on ID
es: Habilitar alimentación en el Identificador

source: Enable Power Pin 1
es: Habilitar Pin de Alimentación 1

source: Enable Power Pin 2
es: Habilitar Pin de Alimentación 2

source: Enable Power Pin 3
es: Habilitar Pin de Alimentación 3

source: Enable Power Pin 4
es: Habilitar Pin de Alimentación 4

source: Enable Power Pin 5
es: Habilitar Pin de Alimentación 5

source: Enable Power Pin 6
es: Habilitar Pin de Alimentación 6

source: Continuous Scanning
es: Lectura Contínua

source: Enable Continuous Scanning
es: Habilitar Lectura Contínua

source: Number of Reads to Average
es: Número de Lecturas para Promediar

source: Scan Interval (ms)
es: Intervalo de Lectura (ms)

source: Blade Detect
es: Detección de Hoja

source: Blade Detect Pin
es: Pin de Detección de Hoja

source: Custom Options
es: Opciones Personalizadas

source: Defines are in the format: #define [NAME] [VALUE]
es: Las definiciones están en el formato: #define [NOMBRE] [VALOR]

source: Add Custom Define
es: Agregar Definición Personalizada

source: Links For Additional ProffieOS Defines
es: Links a Definiciones de ProffieOS Adicionales

source: (ProffieConfig already handles some of these)
es: (ProffieConfig ya se encarga de algunos de estos)

source: Optional Defines
es: Definiciones Opcionales

source: History of Clash Detection
es: Historial de Detección de Choques

source: Once you add custom options they'll show up here.
es: Una vez que haya agregado opciones personalizadas, se mostrarán aquí.

source: Remove
es: Eliminar

source: You currently have unsaved changes which will be lost otherwise.
es: En este momento tiene cambios sin guardar que, de lo contrario, se perderán.

source: Save Changes to "%s"?
es: ¿Guardar los cambios hechos a "%s"?

source: Save Changes
es: Guardar Cambios

source: Discard Changes
es: Descartar Cambios

source: Cancel
es: Cancelar

source: Select Injection File
es: Elegir Archivo de Inyección

source: Verify Config Ctrl+R
es: Verificar Configuración Ctrl+R

source: Save Config Ctrl+S
es: Guardar Configuración Ctrl+S

source: Export Config...
es: Exportar Configuración...

source: Add Injection...
es: Agregar Inyección...

source: Add a header file to be injected into CONFIG_PRESETS during compilation.
es: Agregar un archivo de encabezado para inyectarlo en CONFIG_PRESETS durante la compilación.

source: Style Editor...
es: Editor de Estilos...

source: Open the ProffieOS style editor
es: Abrir el editor de estilos de ProffieOS

source: &File
es: &Archivo

source: &Tools
es: &Herramientas

source: Prop File
es: Archivo Prop

source: Presets And Styles
es: Presets y Estilos

source: Cree Red
es: "Cree" Rojo

source: Cree Green
es: "Cree" Verde

source: Cree Blue
es: "Cree" Azul

source: Cree Amber
es: "Cree" Ámbar

source: Cree Red-Orange
es: "Cree" Vermellón

source: Cree White
es: "Cree" Blanco

source: Red
es: Rojo

source: Green
es: Verde

source: Blue
es: Azul

source: The currently-selected Blade Array to edit.
es: El Array de Hoja seleccionado para editar.

source: Add a blade to the selected blade array.
es: Agregar una hoja al array de hoja seleccionado.

source: Remove the currently-selected blade.
es: Eliminar la hoja seleccionada.

source: Add a Sub-Blade to the currently-selected blade. Can only be used with WS281X-type blades.
es: Agregar una Subhoja a la hoja seleccionada. Solo se puede usar en hojas del tipo WS281X.

source: Remove the currently-selected Sub-Blade. If there are less than 2 Sub-Blades after removal, the remaining Sub-Blade will be deleted.
es: Eliminar la Subhoja seleccionada. Si quedan menos de 2 Subhojas luego de la eliminación, las Subhoja restante se eliminará también.

source: The type of blade/LED.
es: El tipo de hoja/LED.

source: The power pins to use for this blade. WS281X blades can have as many as are desired (though 2 is generally enough for most blades)
es: El pines de alimentación que se usarán para esta hoja. Las hojas WS281X pueden tener tantas como se desee (aunque, por lo general, 2 es suficiente para la mayoría de las hojas)

source: The pin name or number used for WS281X data. Specify custom pins by typing in this box.
es: El nombre o número de pin usado para el canal de datos WS281X. Especifique pines personalizados escribiéndolos en esta casilla.

source: The number of pixels in your blade (total).
es: El número de píxeles de su hoja (totales).

source: Split apart data into continuous given sections.
es: Dividir los datos en secciones continuas.

source: Useful to KR style blades and other similar types where the data signal "strides" back and forth across sides.
es: Útil para hojas de tipo KR y otros tipos similares, donde la señal de datos "salta" de un lado a otro.

source: Similar to using stride, but for blades in which the data is continuous, "zig-zagging" up and down the blade.
es: Similar a usar salto, pero para hojas en las que los datos son continuos, "zigzagueando" de arriba a abajo de la hoja.

source: The starting pixel number for the current Sub-Blade. This number starts at 0.
es: El número de píxel de inicio de la Subhoja en uso. Este número inicia en 0.

source: The ending pixel number for the current Sub-Blade. This number should not exceed the "Number of Pixels" in the blade.
es: El número de píxel final de la Subhoja en uso. Este número no debe exceder el "Número de Píxeles" de la hoja.

source: The profile/type of the first LED. Corresponds to the first-selected power pin.
es: El perfil/tipo del primer LED. Corresponde al pin de alimentación seleccionado como primero.

source: The profile/type of the second LED. Corresponds to the second-selected power pin.
es: El perfil/tipo del segundo LED. Corresponde al pin de alimentación seleccionado como segundo.

source: The profile/type of the third LED. Corresponds to the third-selected power pin.
es: El perfil/tipo del tercer LED. Corresponde al pin de alimentación seleccionado como tercero.

source: The profile/type of the fourth LED. Corresponds to the fourth-selected power pin.
es: El perfil/tipo del cuarto LED. Corresponde al pin de alimentación seleccionado como cuarto.

source: The value of the resistor placed in series with this led.
es: El valor del resistor instalado en serie para este LED.

source: Blade Array
es: Array de Hoja

source: Blade Awareness...
es: Supervisión de Hojas...

source: Blades
es: Hojas

source: SubBlades
es: Subhojas

source: Blade Type
es: Tipo de Hoja

source: Pin Name
es: Nombre del Pin

source: Color Order
es: Orden de Colores

source: Use RGB with White
es: Usar RVA con Blanco

source: Blade Data Pin
es: Pin de Datos de la Hoja

source: Number of Pixels
es: Número de Píxeles

source: Resistance (mOhms)
es: Resistencia (mOhms)

source: Standard SubBlade
es: Subhoja Estándar

source: Stride SubBlade
es: Subhoja por Saltos

source: ZigZag SubBlade
es: Subhoja por ZigZag

source: SubBlade Start
es: Inicio de la Subhoja

source: SubBlade End
es: Fin de la Subhoja

source: Blade %d
es: Hoja %d

source: SubBlade %d
es: Subhoja %d

source: Simple LED
es: LED Simple

source: The hardware revision of the physical proffieboard.
es: La revisión de hardware del Proffieboard físico.

source: Enable to access the contents of your proffieboard's SD card via the USB connection.
es: Habilita el acceso al contenido de la tarjeta SD de su Proffieboard por USB.

source: Enable to access the ProffieOS Workbench via USB. See the POD Page "The ProffieOS Workbench" for more info.
es: Habilita el acceso al Banco de Trabajo de ProffieOS por USB. Lea la página POD "Banco de Trabajo de ProffieOS" para más información.

source: The orientation of the Proffieboard in the saber.
es: La orientación del Proffieboard en el sable.

source: Physical buttons on the saber. Not all prop files support all possible numbers of buttons, and controls may change depending on how many buttons are specified.
es: Los botones físicos del sable. No todos los archivos Prop soportan todos los números posibles de botones, y los controles pueden cambiar dependiendo de cuántos botones se especifiquen.

source: Maximum volume level. Do not increase unless you know what you are doing, as this can damage your speaker.
es: Nivel máximo de volumen. No lo aumente a menos que sepa lo que está haciendo, ya que esto puede dañar su parlante.

source: Impact required to trigger a clash effect. Measured in Gs.
es: Fuerza del impacto requerida para disparar un efecto de choque. Medida en G.

source: Time (in minutes) since last activity before PLI goes to sleep.
es: Tiempo (en minutos) transcurrido desde la última actividad hasta que el PLI entre en suspensión.

source: Time (in minutes) since last activity before accent LEDs go to sleep.
es: Tiempo (en minutos) transcurrido desde la última actividad hasta que los LEDs de énfasis entren en suspensión.

source: Time (in minutes) since last activity before gesture controls are disabled.
es: Tiempo (en minutos) transcurrido desde la última actividad antes de que se deshabiliten los controles gestuales.

source: Maximum number of LEDs in a WS281X blade. This value should not be changed unless you know what you are doing. Configure the length of your blade in the "Blade Arrays" page.
es: Número máximo de LEDs in a WS281X blade. This value should not be changed unless you know what you are doing. Configure the length of your blade in the "Blade Arrays" page.

source: Save the volume level between board restarts.
es: Conservar el nivel de volumen entre reinicios de la placa.

source: Save the currently-selected preset between board restarts.
es: Conservar el preset actualmente seleccionado entre reinicios de la placa.

source: Save color edits to presets.
es: Guardar las preferencias de color en los presets.

source: Enable if you have an OLED/SSD1306 display connected.
es: Habilitar si tiene conectada una pantalla OLED/SSD1306.

source: Disable color change controls.
es: Deshabilitar los controles de cambio de color.

source: Use beeps instead of spoken messages for errors, which saves some memory. See the POD page "What is it beeping?".
es: Usar pitidos en lugar de mensajes hablados para errores, lo que permite ahorrar algo de memoria. Vea la página de POD "¿Qué está pitando?".

source: Disable basic styles in the ProffieOS Workbench to save memory.
es: Deshabilitar los estilos básicos en el Banco de Trabajo de ProffieOS para ahorrar memoria.

source: Disable diagnostic commands in the Serial Monitor to save memory.
es: Deshabilitar los comandos de diagnóstico en el Monitor Serial para ahorrar memoria.

source: Board Setup
es: Ajustes de Placa

source: Enable Mass Storage
es: Habilitar Almacenamiento Masivo

source: Enable WebUSB
es: Habilitar USB

source: Options
es: Opciones

source: Save Volume
es: Guardar Volumen

source: Save Preset
es: Guardar Preset

source: Save Color
es: Guardar Color

source: Enable OLED
es: Habilitar OLED

source: Disable Color Change
es: Deshabilitar Cambio de Color

source: Disable Talkie
es: Deshabilitar Voces

source: Disable Basic Parser Styles
es: Deshabilitar Estilos Básicos de Analizador

source: Disable Diagnostic Commands
es: Deshabilitar Comandos de Diagnóstico

source: Custom Options...
es: Opciones Personalizadas...

source: Orientation
es: Orientación

source: Number of Buttons
es: Número de Botones

source: Max Volume
es: Volumen Máximo

source: Clash Threshold (Gs)
es: Umbral de Impacto (G)

source: PLI Timeout (minutes)
es: Temporizador de fin PLI (minutos)

source: Idle Timeout (minutes)
es: Temporizador de Reposo (minutos)

source: Motion Timeout (minutes)
es: Temporizador de Movimiento (minutos)

source: WS281X Max LEDs
es: Número Máximo de LEDs WS281X

source: Comments
es: Comentarios

source: Blade Style
es: Estilo de Hoja

source: The name for the preset. This appears on the OLED screen if no bitmap is supplied, otherwise it's just for reference. Using "\n" is like hitting "enter" when the text is displayed on the OLED. For example, "my\npreset" will be displayed on the OLED as two lines, the first being "my" and the second being "preset".
es: El nombre para el preset. Esto aparece en la pantalla OLED si no se proporciona un bitmap, en caso contrario se usa solo como referencia. Usar "\n" es como presionar "enter" cuando se muestra el texto en la pantalla OLED. Por ejemplo: "mi\npreset" se mostrará en la pantalla como dos líneas, la primera será "mi" y la segunda será "preset".

source: The path of the folder on the SD card where the font is stored. If the font folder is inside another folder, it must be indicated by something like "folderName/fontFolderName". In order to specify multiple directories (for example, to inlclude a "common" directory), use a semicolon (;) to seperate the folders (e.g. "fontFolderName;common").
es: La ruta de acceso a la carpeta en la tarjeta SD donde se almacenan las fuentes. Si la carpeta de fuentes está adentro de otra carpeta, debe ser indicado de forma similar a "nombreCarpeta/nombreCarpetaFuentes". Para especificar directorios múltiples (por ejemplo, para incluir un directorio "común") usar un punto y coma (;) para separar las carpetas (ej.: "nombreCarpetaFuentes;común")

source: The path of the track file on the SD card. If the track is directly inside one of the folders specified in "Font Directory" then only the name of the track file is required.
es: La ruta de acceso a la pista, en la tarjeta SD. Si la pista está directamente en una de las carpetas especificadas en el "Directorio de Fuentes", solo es necesario el nombre del archivo de pista.

source: The currently-selected blade array to be edited. Each blade array has unique presets.
es: La matriz de hojas seleccionada para editar. Cada matriz de hojas tiene presets únicos.

source: All presets in this blade array. Select a preset and blade to edit associated blade styles.
es: Todos los presets en esta matriz de hojas. Seleccione un preset y una hoja para editar los estilos de hoja asociados.

source: All blades in this blade array. Select a preset and blade to edit associated blade styles.
es: Todas las hojas en esta matriz de hojas. Seleccione un preset y una hoja para editar los estilos de hoja asociados.

source: Add a preset to the currently-selected blade array.
es: Agregar un preset a la matriz de hojas seleccionada.

source: Delete the currently-selected preset.
es: Borrar el preset seleccionado.

source: Any comments about the blade style goes here. This doesn't affect the blade style at all, but can be a place for helpful notes!
es: Cualquier comentario respecto del estilo de hoja va aquí. Esto no afecta al estilo de hoja en lo absoluto, ¡pero puede ser un lugar para poner notas útiles!

source: Your blade style goes here. This is the code which sets up what animations and effects your blade (or other LED) will do. For getting/creating blade styles, see the Documentation (in "Help->Documentation...").
es: El estilo de su hoja va aquí. Este es el código que controla qué animaciones y efectos su hoja (u otro LED) mostrará. Para conseguir/crear estilos de hoja, vea la Documentación (en "Ayuda->Documentación...").

source: Preset Name
es: Nombre de Preset

source: Font Directory
es: Directorio de Fuentes

source: Track File
es: Pista

source: Injections
es: Inyecciones

source: Edit
es: Editar

source: Delete
es: Eliminar

source: This action cannot be undone!
es: ¡Esta acción no puede deshacerse!

source: Delete Injection
es: Borrar Inyección

source: Blade %d:%d
es: Hoja %d:%d

source: Select blade to edit style comments...
es: Seleccionar una hoja para editar los comentarios de estilo...

source: Select blade to edit style...
es: Seleccionar una hoja para editar el estilo...

source: Select or create preset and blade to edit style comments...
es: Seleccionar o crear un preset y una hoja para editar los comentarios de estilo...

source: Select or create preset and blade to edit style...
es: Seleccionar o crear un preset y una hoja para editar el estilo...

source: Default
es: Por Defecto

source: Prop Description and Usage Info...
es: Descripción del Prop e Información de Uso...

source: Button Controls...
es: Controles de botón...

source: View prop creator-provided information about this prop and its intended usage.
es: Ver la información sobre el uso del prop, provista por el creador de props.

source: View button controls based on specific option settings and number of buttons.
es: Ver los controles de botones basado en el ajuste de opciones específicas y el número de botones.

source: Buttons
es: Botones

source: On/Off - Twist Next preset - Point up and shake Clash - Hit the blade while saber is on.
es: Encendido/Apagado - Rotar. Preset Siguiente - Apuntar el sable hacia arriba y agitar. Choque - Golpear la hoja con el sable encendido.
